---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.Clear
source: html/88759463-1d12-1747-b55e-13221d0b7f88.htm
---
# Autodesk.Revit.DB.ExportPatternTable.Clear Method

Removes all contents stored in the table.

## Syntax (C#)
```csharp
public void Clear()
```